{"config": [{"config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 500, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 784], "kernel_initializer": "glorot_uniform", "input_dtype": "float32", "trainable": true, "input_dim": 784, "bias_regularizer": null, "name": "encoder1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 500, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "encoder2", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 2000, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "encoder3", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 10, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "encoder4", "activation": "linear"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 2000, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "decoder1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 500, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "decoder2", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 500, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "decoder3", "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 784, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": "glorot_uniform", "bias_regularizer": null, "input_dim": null, "kernel_constraint": null, "name": "decoder4", "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.0.8"}
